# modified by iks. thanks.

def kao_desc
  "kao>: 撮矢机を叫します。"
end

def kao(msg)
  arms = [
    ['(s', ')ノ'],
    ['(s', ')】'],
    ['±(', 's)'],
    ['〈(', 's)'],
    ['〕(', 's)'],
    ['〕(', 's)〉'],
    ['〈(', 's)〉'],
    ['⒘(', 's)⒘'],
    ['〕(', 's)ノ'],
    ['±(', 's)】'],

    ['ε=ε=ε=ε=〕(S', ')ノ'],
    ['〕(', 'S)ノ=３=３=３'],

    ['(s', ')客(…⑾‘*)'],
    ['(s', ')客(…Д‘;)'],

    ['キタìììì(', 's)ìììì !!!!!'],
    ['ハァìììì〃', 'ìììì ン!!!'],
    ['(ノ', ')ノˇ∨∧ììì→'],

    ['m9(', 's) プギャ〖'],
    [' m9っ(', 's)っ'],

    ['(S', ')σ)Д`)'],
    ['(#', ')】※(ˇωˇ)'],
    ['ⅲì⒕(S', ') 啄※`Д…)ノ'],
    ['(#', ')ǎò※)Д‘)'],

    ['(', 'Ａ アセアセ'],
    ['ナッ (S', ')y ±_~~~ ポロッ'],

    ["ァ'`,、'`,、'`,、(", ") '`,、'`,、'`,、"],
    ['供供エエェェ(', ')ェェエエ供供 '],
    ['( …|ミ〕( ', ')ノミ|_〉‘)'],

    ['<〕', '> ウェ〖ハッハ'],

    ['|', ')'],
  ]
  eyes = [
    ['…', '`'],
    ['…', '‘'],
    ['ˇ', 'ˇ'],
    ['‘', '…'],
    ['‖', '‖'],
    ['》', '》'],
    ['σ', 'σ'],
    ['”', '”'],
    ['^', '^'],
    ['T', 'T'],
    ['…ˇ', 'ˇ‘'],
    ['′', '°'],
    ['△', '△'],
  ]
  mouthes = [
    'ω',
    '⑾',
    '。',
    'ⅵ',
    'д',
    'ⅱ',
    '〓',
    'ρ',
    'ヮ',
    '〖',
    'O',
    'o',
    '〔',
    'Ａ',
    'Д',
    '划',
  ]
  opts = [
    '*',
    ';',
    '#',
  ]

  if (msg == 'kind')
    return "#{4*arms.size*eyes.size*mouthes.size} 硷梧の撮矢机が栏喇されます"
  end

  ret = mouthes[rand(mouthes.size)]
  eye = eyes[rand(eyes.size)]
  ret = eye[0] + ret + eye[1]
#  ret = '(' + ret + ')'
  arm = arms[rand(arms.size)]
  ret = arm[0] + ret + arm[1]

  if (rand(5) == 0)
    opt = opts[rand(opts.size)]
    ret = ret.gsub(/S/, "#{opt}")
    ret = ret.gsub(/s/, "#{opt}")
  else
    ret = ret.gsub(/S/, " ")
    ret = ret.gsub(/s/, "")
  end

  "#{ret} #{msg}"
end
