def misakura_desc
  "misakura>words: words をみさくら誤変換します。"
end

def misakura_table
  [
   [/だ/e,'ら'],
   [/さ/e,'しゃ'],
   [/な/e,'にゃ'],
   [/つ/e,'ちゅ'],
   [/ちゃ/e,'ひゃ'],
   [/じゃ/e,'に゛ゃ'],
   [/ほ/e,'ほお゛お゛っ'],
   [/で/e,'れ'],
   [/す/e,'しゅ'],
   [/ざ/e,'じゃ'],
   [/い/e,'いぃ'],
   [/の/e,'のぉおお'],
   [/ぁ/e,'ぁぁ゛ぁ゛'],
   [/あ/e,'ぁあああ あぉ'],
   [/お/e,'おﾞぉおォおん'],
   [/(気持|きも)ちいい/e,'ぎも゛ぢい゛い゛ぃ'],
   [/(大好|だいす)き/e,'らいしゅきいぃっ'],
   [/(ミルク|みるく|牛乳)/e,'ちんぽミルク'],
   [/お(願|ねが)い/e,'お願いぃぃぃっっっﾞ'],
   [/ごきげんよう/e,'ごきげんよぉおお！んおっ！んおおーーっ！ '],
   [/ごきげんよう/e,'ごきげんみゃぁあ゛あ゛ぁ゛ぁぁあ！！'],
   [/こん(にち|ばん)[はわ]/e,'こん\1みゃぁあ゛あ゛ぁ゛ぁぁあ！！'],
   [/えて/e,'えてへぇええぇﾞ'],
   [/する/e,'するの'],
   [/します/e,'するの'],
   [/精液/e,'せーしっせーし でりゅぅ でちゃいましゅ みるく ちんぽみるく ふたなりみるく'],
   [/射精/e,'でちゃうっ れちゃうよぉおおﾞ'],
   [/(馬鹿|バカ|ばか)/e,'バカ！バカ！まんこ!!'],
   [/いい/e,'いぃぃっよぉおおﾞ'],
   [/[好す]き/e,'ちゅき'],
   [/して/e,'してぇぇぇぇ゛'],
   [/行く/e,'んはっ イっぐぅぅぅふうぅ'],
   [/いく/e,'イっくぅぅふぅん'],
   [/イク/e,'イッちゃううぅん'],
   [/駄目/e,'らめにゃのぉぉぉ゛'],
   [/ダメ/e,'んぉほぉぉォォ　らめぇ'],
   [/だめ/e,'らめぇぇ'],
   [/ちゃん/e,'ちゃぁん'],
   [/(おい|美味)しい/e,'\1ひぃ…れしゅぅ'],
   [/(た|る|ない)([。、　 ・…!?！？」])/e,'\1の\2'],
   [/さい([。、　 ・…!?！？」])/e,'さいなの\1'],
   [/よ([。、　 ・…!?！？」])/e,'よお゛お゛お゛ぉ\1'],
   [/もう/e,'んもぉ゛お゛お゛ぉぉ'],
   [/(い|入)れて/e,'いれてえぇぇぇえ'],
   [/(気持|きも)ちいい/e,'きも゛ぢい゛~っ'],
   [/(がんば|頑張)る/e,'尻穴ちんぽしごき\1るぅ!!!'],
   [/出る/e,'でちゃうっ れちゃうよぉおおﾞ'],
   [/でる/e,'でっ…でるぅでるうぅうぅ'],
   [/です/e,'れしゅぅぅぅ'],
   [/ます/e,'ましゅぅぅぅ'],
   [/はい/e,'はひぃ'],
   [/スゴイ/e,'スゴぉッ!!'],
   [/(すご|凄)い/e,'しゅごいのょぉぉぅ'],
  ]
end

def misakura(msg)
  msg = j2e(msg)
  misakura_table.each do |pat, rep|
    msg.gsub!(pat, rep)
  end
  msg
end
